Revit 2024 API
FilterRule Methods
The FilterRule type exposes the following members.
Methods
Name | Description
Dispose
ElementPasses
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRuleParameter
 Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FilterRule Class
Autodesk.Revit.DB Namespace